// pages/guShiJiangJie/index.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    list: [{
        name: '一年级（上）',
        key: '0101'
      },
      {
        name: '一年级（下）',
        key: '0102'
      },
      {
        name: '二年级（上）',
        key: '0201'
      },
      {
        name: '二年级（下）',
        key: '0202'
      },
      {
        name: '三年级（上）',
        key: '0301'
      },
      {
        name: '三年级（下）',
        key: '0302'
      },
      {
        name: '四年级（上）',
        key: '0401'
      },
      {
        name: '四年级（下）',
        key: '0402'
      },
      {
        name: '五年级（上）',
        key: '0501'
      },
      {
        name: '五年级（下）',
        key: '0502'
      },
      {
        name: '六年级（上）',
        key: '0601'
      },
      {
        name: '六年级（下）',
        key: '0602'
      },
      {
        name: '七年级（上）',
        key: '0701'
      },
      {
        name: '七年级（下）',
        key: '0702'
      },
      {
        name: '八年级（上）',
        key: '0801'
      },
      {
        name: '八年级（下）',
        key: '0802'
      },
      {
        name: '九年级（上）',
        key: '0901'
      },
      {
        name: '九年级（下）',
        key: '0902'
      },
    ]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad(options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady() {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow() {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide() {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload() {

  },

  /**
   * 页面相关事件处理函数--监听用户（下）拉动作
   */
  onPullDownRefresh() {

  },

  /**
   * 页面（上）拉触底事件的处理函数
   */
  onReachBottom() {

  },

  /**
   * 用户点击右（上）角分享
   */
  onShareAppMessage() {

  }
})